In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.read_csv("agg_trans_table.csv")

In [3]:
df1.head()

,payment_mode,total_transaction_count,total_amount,quater,year,state
0,Recharge & bill payments,4200,1.845307e+06,1,2018,andaman-&-nicobar-islands
1,Peer-to-peer payments,1871,1.213866e+07,1,2018,andaman-&-nicobar-islands
2,Merchant payments,298,4.525072e+05,1,2018,andaman-&-nicobar-islands
3,Financial Services,33,1.060142e+04,1,2018,andaman-&-nicobar-islands
4,Others,256,1.846899e+05,1,2018,andaman-&-nicobar-islands

In [4]:
# check for null values
df1.describe()
# from the summary table, we can conclude that there are no outliers

       total_transaction_count  total_amount       quater         year
count             3.594000e+03  3.594000e+03  3594.000000  3594.000000
mean              1.995652e+07  3.378017e+10     2.501113  2020.001948
std               7.032910e+07  1.417195e+11     1.118189     1.414507
min               2.000000e+00  3.439721e+01     1.000000  2018.000000
25%               4.134475e+04  2.690695e+07     2.000000  2019.000000
50%               3.637465e+05  2.862499e+08     3.000000  2020.000000
75%               6.380843e+06  5.641061e+09     4.000000  2021.000000
max               1.025666e+09  2.393380e+12     4.000000  2022.000000

In [5]:
# check for null values
df1.isnull().sum()

payment_mode               0
total_transaction_count    0
total_amount               0
quater                     0
year                       0
state                      0
dtype: int64

In [6]:
# check for any duplicated rows and if there, drop it
df1 = df1.drop_duplicates()

In [7]:
df1.shape

(3594, 6)

In [8]:
df1.columns

Index(['payment_mode', 'total_transaction_count', 'total_amount', 'quater',
       'year', 'state'],
      dtype='object')

In [9]:
# checking whether the columns are assigned with correct dtypes
df1.dtypes

payment_mode                object
total_transaction_count      int64
total_amount               float64
quater                       int64
year                         int64
state                       object
dtype: object

In [10]:
# checking for any odd names present in that column
df1["payment_mode"].value_counts()

Recharge & bill payments    720
Peer-to-peer payments       720
Merchant payments           720
Others                      720
Financial Services          714
Name: payment_mode, dtype: int64

In [11]:
# checking for any odd names present in that column
df1["state"].value_counts()

andaman-&-nicobar-islands             100
andhra-pradesh                        100
maharashtra                           100
manipur                               100
meghalaya                             100
mizoram                               100
nagaland                              100
odisha                                100
puducherry                            100
punjab                                100
rajasthan                             100
sikkim                                100
tamil-nadu                            100
telangana                             100
tripura                               100
uttar-pradesh                         100
uttarakhand                           100
madhya-pradesh                        100
west-bengal                           100
ladakh                                100
delhi                                 100
arunachal-pradesh                     100
assam                                 100
bihar                                 100
chandigarh                            100
chhattisgarh                          100
dadra-&-nagar-haveli-&-daman-&-diu    100
goa                                   100
kerala                                100
gujarat                               100
haryana                               100
himachal-pradesh                      100
jammu-&-kashmir                       100
jharkhand                             100
karnataka                             100
lakshadweep                            94
Name: state, dtype: int64

In [12]:
df2 = pd.read_csv("agg_trans_summary_table.csv")

In [13]:
df2.head()

                       state  year  quater      date_from        date_to
0  andaman-&-nicobar-islands  2018       1  1514745000000  1522175400000
1  andaman-&-nicobar-islands  2018       2  1522521000000  1530124200000
2  andaman-&-nicobar-islands  2018       3  1530383400000  1538073000000
3  andaman-&-nicobar-islands  2018       4  1538332200000  1545935400000
4  andaman-&-nicobar-islands  2019       1  1546281000000  1553711400000

In [14]:
# check for null values
df2.isnull().sum()

state        0
year         0
quater       0
date_from    0
date_to      0
dtype: int64

In [15]:
# che2ck for any duplicated rows and if there, drop it
df2 = df2.drop_duplicates()

In [16]:
df2.shape

(720, 5)

In [17]:
df2.columns

Index(['state', 'year', 'quater', 'date_from', 'date_to'], dtype='object')

In [18]:
df2["state"].value_counts()

andaman-&-nicobar-islands             20
andhra-pradesh                        20
maharashtra                           20
manipur                               20
meghalaya                             20
mizoram                               20
nagaland                              20
odisha                                20
puducherry                            20
punjab                                20
rajasthan                             20
sikkim                                20
tamil-nadu                            20
telangana                             20
tripura                               20
uttar-pradesh                         20
uttarakhand                           20
madhya-pradesh                        20
lakshadweep                           20
ladakh                                20
delhi                                 20
arunachal-pradesh                     20
assam                                 20
bihar                                 20
chandigarh                            20
chhattisgarh                          20
dadra-&-nagar-haveli-&-daman-&-diu    20
goa                                   20
kerala                                20
gujarat                               20
haryana                               20
himachal-pradesh                      20
jammu-&-kashmir                       20
jharkhand                             20
karnataka                             20
west-bengal                           20
Name: state, dtype: int64

In [19]:
df2.dtypes

state        object
year          int64
quater        int64
date_from     int64
date_to       int64
dtype: object

In [20]:
df2.head()

                       state  year  quater      date_from        date_to
0  andaman-&-nicobar-islands  2018       1  1514745000000  1522175400000
1  andaman-&-nicobar-islands  2018       2  1522521000000  1530124200000
2  andaman-&-nicobar-islands  2018       3  1530383400000  1538073000000
3  andaman-&-nicobar-islands  2018       4  1538332200000  1545935400000
4  andaman-&-nicobar-islands  2019       1  1546281000000  1553711400000

In [21]:
df3 = pd.read_csv("agg_user_table.csv")

In [22]:
df3.head()

,brand_name,registered_user_count_per_brand,percentage_share_of_brand,quater,year,state
0,Xiaomi,1665,0.247033,1,2018,andaman-&-nicobar-islands
1,Samsung,1445,0.214392,1,2018,andaman-&-nicobar-islands
2,Vivo,982,0.145697,1,2018,andaman-&-nicobar-islands
3,Oppo,501,0.074332,1,2018,andaman-&-nicobar-islands
4,OnePlus,332,0.049258,1,2018,andaman-&-nicobar-islands

In [23]:
# check for null values
df3.isnull().sum()

brand_name                         0
registered_user_count_per_brand    0
percentage_share_of_brand          0
quater                             0
year                               0
state                              0
dtype: int64

In [24]:
# check for any duplicated rows and if there, drop it
df3 = df3.drop_duplicates()

In [25]:
df3.shape

(6732, 6)

In [26]:
df3.columns

Index(['brand_name', 'registered_user_count_per_brand',
       'percentage_share_of_brand', 'quater', 'year', 'state'],
      dtype='object')

In [27]:
df3.dtypes

brand_name                          object
registered_user_count_per_brand      int64
percentage_share_of_brand          float64
quater                               int64
year                                 int64
state                               object
dtype: object

In [28]:
df3.describe()
# no outliers

,registered_user_count_per_brand,percentage_share_of_brand,quater,year
count,6.732000e+03,6732.000000,6732.000000,6732.000000
mean,5.140115e+05,0.090909,2.411765,2019.647059
std,1.081772e+06,0.083401,1.140715,1.233984
min,1.000000e+01,0.005158,1.000000,2018.000000
25%,9.354000e+03,0.020513,1.000000,2019.000000
50%,8.472250e+04,0.057718,2.000000,2020.000000
75%,4.555808e+05,0.146007,3.000000,2021.000000
max,1.134094e+07,0.478367,4.000000,2022.000000

In [29]:
df4 = pd.read_csv("agg_user_summary_table.csv")

In [30]:
df4.head()

                       state  year  quater  registered_users  app_opens
0  andaman-&-nicobar-islands  2018       1              6740          0
1  andaman-&-nicobar-islands  2018       2              9405          0
2  andaman-&-nicobar-islands  2018       3             12149          0
3  andaman-&-nicobar-islands  2018       4             15222          0
4  andaman-&-nicobar-islands  2019       1             18596          0

In [31]:
df4.isnull().sum()

state               0
year                0
quater              0
registered_users    0
app_opens           0
dtype: int64

In [32]:
# here appopens cannot have the value 0. So, the rows that contain 0 are null value
df4.loc[df4['app_opens'] == 0, :]

                         state  year  quater  registered_users  app_opens
0    andaman-&-nicobar-islands  2018       1              6740          0
1    andaman-&-nicobar-islands  2018       2              9405          0
2    andaman-&-nicobar-islands  2018       3             12149          0
3    andaman-&-nicobar-islands  2018       4             15222          0
4    andaman-&-nicobar-islands  2019       1             18596          0
..                         ...   ...     ...               ...        ...
700                west-bengal  2018       1           2604789          0
701                west-bengal  2018       2           3833795          0
702                west-bengal  2018       3           4851740          0
703                west-bengal  2018       4           6279278          0
704                west-bengal  2019       1           7449425          0

[180 rows x 5 columns]

In [33]:
df4.shape
# Out of 720 rows, 180 rows have null values on "App Opens" column, 25% of rows

(720, 5)

In [34]:
df4.describe()
# there are null values in App Opens column

              year      quater  registered_users     app_opens
count   720.000000  720.000000      7.200000e+02  7.200000e+02
mean   2020.000000    2.500000      6.530581e+06  2.092897e+08
std       1.415197    1.118811      9.267287e+06  4.482347e+08
min    2018.000000    1.000000      5.010000e+02  0.000000e+00
25%    2019.000000    1.750000      2.232690e+05  3.435000e+03
50%    2020.000000    2.500000      2.188502e+06  1.194155e+07
75%    2021.000000    3.250000      9.626175e+06  2.056444e+08
max    2022.000000    4.000000      5.595403e+07  3.299788e+09

In [35]:
# imputing the appopens null values with mean value
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(strategy = 'mean', missing_values = 0)
imputer = imputer.fit(df4['app_opens'].values.reshape(-1,1))
df4['app_opens'] = imputer.transform(df4['app_opens'].values.reshape(-1,1))
df4

                         state  year  quater  registered_users     app_opens
0    andaman-&-nicobar-islands  2018       1              6740  2.790529e+08
1    andaman-&-nicobar-islands  2018       2              9405  2.790529e+08
2    andaman-&-nicobar-islands  2018       3             12149  2.790529e+08
3    andaman-&-nicobar-islands  2018       4             15222  2.790529e+08
4    andaman-&-nicobar-islands  2019       1             18596  2.790529e+08
..                         ...   ...     ...               ...           ...
715                west-bengal  2021       4          20644527  5.123358e+08
716                west-bengal  2022       1          21919787  2.361311e+08
717                west-bengal  2022       2          23124388  2.502764e+08
718                west-bengal  2022       3          24372048  2.564457e+08
719                west-bengal  2022       4          25536381  6.780663e+08

[720 rows x 5 columns]

In [36]:
df4 = df4.drop_duplicates()

In [37]:
df5 = pd.read_csv("lat_long_state.csv")

In [38]:
df5.head()

  code   latitude  longitude           state
0   PY  10.915649  79.806949      puducherry
1   TN  10.909433  78.366535      tamil-nadu
2   UP  27.130334  80.859666   uttar-pradesh
3   MP  23.814342  77.534072  madhya-pradesh
4   AD  15.924091  80.186381  andhra-pradesh

In [39]:
df5.isnull().sum()

code         0
latitude     0
longitude    0
state        0
dtype: int64

In [40]:
df5.dtypes

code          object
latitude     float64
longitude    float64
state         object
dtype: object

In [41]:
df5.describe()
# no outliers

        latitude  longitude
count  36.000000  36.000000
mean   22.888941  81.708671
std     6.881745   7.417340
min    10.000105  70.932383
25%    18.642525  75.930588
50%    23.794712  79.102429
75%    27.724214  87.877725
max    33.945641  94.592133

In [42]:
df5 = df5.drop_duplicates()

In [43]:
df5.shape

(36, 4)

In [44]:
df5.columns

Index(['code', 'latitude', 'longitude', 'state'], dtype='object')

In [45]:
df6 = pd.read_csv("lat_long_district.csv")

In [46]:
df6.head()

,state,district_name,latitude,longitude
0,andaman-&-nicobar-islands,north and middle andaman district,11.554828,92.238490
1,andaman-&-nicobar-islands,south andaman district,10.705690,92.487468
2,andaman-&-nicobar-islands,nicobars district,10.705690,92.487468
3,andhra-pradesh,east godavari district,17.233496,81.722599
4,andhra-pradesh,srikakulam district,17.233496,81.722599

In [47]:
df6.isnull().sum()

state            0
district_name    0
latitude         0
longitude        0
dtype: int64

In [48]:
df6 = df6.drop_duplicates()

In [49]:
df6.describe()
# no outliers

         latitude   longitude
count  732.000000  732.000000
mean    23.259950   81.184235
std      5.775478    6.617195
min      8.549501   68.968002
25%     20.159527   76.413091
50%     24.342985   79.065807
75%     27.232621   85.128940
max     34.514070   96.827000

In [50]:
df6.shape

(732, 4)

In [51]:
df6.columns

Index(['state', 'district_name', 'latitude', 'longitude'], dtype='object')

In [52]:
df6.dtypes

state             object
district_name     object
latitude         float64
longitude        float64
dtype: object

In [53]:
df7 = pd.read_csv("map_trans_table.csv")

In [54]:
df7.head()

,district_name,total_transaction_count,total_amount,quater,year,state
0,north and middle andaman district,442,9.316631e+05,1,2018,andaman-&-nicobar-islands
1,south andaman district,5688,1.256025e+07,1,2018,andaman-&-nicobar-islands
2,nicobars district,528,1.139849e+06,1,2018,andaman-&-nicobar-islands
3,north and middle andaman district,825,1.317863e+06,2,2018,andaman-&-nicobar-islands
4,south andaman district,9395,2.394824e+07,2,2018,andaman-&-nicobar-islands

In [55]:
df7.describe()
# no outliers

       total_transaction_count  total_amount        quater          year
count             1.463600e+04  1.463600e+04  14636.000000  14636.000000
mean              4.900501e+06  8.295021e+09      2.500205   2020.000547
std               2.648232e+07  3.843130e+10      1.118072      1.414069
min               2.000000e+00  1.698886e+02      1.000000   2018.000000
25%               1.535085e+05  2.726268e+08      2.000000   2019.000000
50%               6.938715e+05  1.315100e+09      3.000000   2020.000000
75%               2.869876e+06  5.488422e+09      4.000000   2021.000000
max               1.133830e+09  1.753800e+12      4.000000   2022.000000

In [56]:
df7.isnull().sum()

district_name              0
total_transaction_count    0
total_amount               0
quater                     0
year                       0
state                      0
dtype: int64

In [57]:
df7 = df7.drop_duplicates()

In [58]:
df7.dtypes

district_name               object
total_transaction_count      int64
total_amount               float64
quater                       int64
year                         int64
state                       object
dtype: object

In [59]:
df7.shape

(14636, 6)

In [60]:
df7.columns

Index(['district_name', 'total_transaction_count', 'total_amount', 'quater',
       'year', 'state'],
      dtype='object')

In [61]:
df8 = pd.read_csv("map_user_table.csv")

In [62]:
df8.head()

,place_name,registered_user_count,app_openings,quater,year,state
0,north and middle andaman district,632,0,1,2018,andaman-&-nicobar-islands
1,south andaman district,5846,0,1,2018,andaman-&-nicobar-islands
2,nicobars district,262,0,1,2018,andaman-&-nicobar-islands
3,north and middle andaman district,911,0,2,2018,andaman-&-nicobar-islands
4,south andaman district,8143,0,2,2018,andaman-&-nicobar-islands

In [63]:
df8.describe()
# '0' in the column "App Openings". These are null values

       registered_user_count  app_openings        quater          year
count           1.464000e+04  1.464000e+04  14640.000000  14640.000000
mean            3.211761e+05  1.029293e+07      2.500000   2020.000000
std             6.222893e+05  2.721393e+07      1.118072      1.414262
min             2.200000e+01  0.000000e+00      1.000000   2018.000000
25%             4.720000e+04  1.800000e+01      1.750000   2019.000000
50%             1.459220e+05  2.395527e+06      2.500000   2020.000000
75%             3.552395e+05  1.015100e+07      3.250000   2021.000000
max             1.465446e+07  1.137875e+09      4.000000   2022.000000

In [64]:
df8.loc[df8['app_openings'] == 0, :]

,place_name,registered_user_count,app_openings,quater,year,state
0,north and middle andaman district,632,0,1,2018,andaman-&-nicobar-islands
1,south andaman district,5846,0,1,2018,andaman-&-nicobar-islands
2,nicobars district,262,0,1,2018,andaman-&-nicobar-islands
3,north and middle andaman district,911,0,2,2018,andaman-&-nicobar-islands
4,south andaman district,8143,0,2,2018,andaman-&-nicobar-islands
...,...,...,...,...,...,...
14290,nadia district,385179,0,1,2019,west-bengal
14291,birbhum district,265201,0,1,2019,west-bengal
14292,purba medinipur district,389583,0,1,2019,west-bengal
14293,maldah district,266012,0,1,2019,west-bengal
14294,darjiling district,145181,0,1,2019,west-bengal

In [65]:
df8.shape
# 3660 rows of 14640 rows have null values which is 25% rows

(14640, 6)

In [66]:
imputer = SimpleImputer(strategy = 'median', missing_values = 0)
imputer = imputer.fit(df8['app_openings'].values.reshape(-1,1))
df8['app_openings'] = imputer.transform(df8['app_openings'].values.reshape(-1,1))
df8

,place_name,registered_user_count,app_openings,quater,year,state
0,north and middle andaman district,632,5275331.0,1,2018,andaman-&-nicobar-islands
1,south andaman district,5846,5275331.0,1,2018,andaman-&-nicobar-islands
2,nicobars district,262,5275331.0,1,2018,andaman-&-nicobar-islands
3,north and middle andaman district,911,5275331.0,2,2018,andaman-&-nicobar-islands
4,south andaman district,8143,5275331.0,2,2018,andaman-&-nicobar-islands
...,...,...,...,...,...,...
14635,nadia district,1359420,33853990.0,4,2022,west-bengal
14636,birbhum district,855236,20950662.0,4,2022,west-bengal
14637,purba medinipur district,1346908,38278506.0,4,2022,west-bengal
14638,maldah district,954892,29023743.0,4,2022,west-bengal
14639,darjiling district,564562,15982631.0,4,2022,west-bengal

In [67]:
df8.isnull().sum()

place_name               0
registered_user_count    0
app_openings             0
quater                   0
year                     0
state                    0
dtype: int64

In [68]:
df8 = df8.drop_duplicates()

In [69]:
df8.dtypes

place_name                object
registered_user_count      int64
app_openings             float64
quater                     int64
year                       int64
state                     object
dtype: object

In [70]:
df8.columns

Index(['place_name', 'registered_user_count', 'app_openings', 'quater', 'year',
       'state'],
      dtype='object')

#### Connecting to a MySQL Database and Inserting the transformed data using SQL commands

In [71]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in d:\anaconda3\lib\site-packages (8.0.32)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in d:\anaconda3\lib\site-packages (from mysql-connector-python) (3.20.3)

In [72]:
import mysql.connector as sql

In [73]:
connection = sql.connect(user = "root", password = "password", host = "localhost")

In [74]:
if connection:
    print("connected successfully")
else:
    print("not connected")

connected successfully

In [75]:
# going to create cursor now
# cursor: It is a function that is used to fetch the data from sql
cursor = connection.cursor()

In [76]:
cursor.execute("show databases")

In [77]:
db = cursor.fetchall()

In [79]:
cursor.execute('CREATE DATABASE phonepe_pulse')
db = cursor.fetchall()
for i in db:
    print(i)

In [80]:
agg_trans_table = """CREATE TABLE agg_trans_table(
my_index INT NOT NULL AUTO_INCREMENT,
payment_mode VARCHAR(200),
total_transaction_count BIGINT,
total_amount BIGINT,
quater INT,
year INT,
state VARCHAR(200),
PRIMARY KEY (my_index))"""
# Auto-increment allows a unique number to be generated automatically when a new record is inserted into a table.

In [81]:
from sqlalchemy import create_engine
engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}".format(user="root",pw="password",db="phonepe_pulse"))

In [82]:
df1.to_sql('agg_trans_table', con = engine, if_exists = 'append', chunksize = 1000)

3594

In [83]:
agg_user_table = """CREATE TABLE agg_user_table(
my_index INT NOT NULL AUTO_INCREMENT,
brand_name VARCHAR(100),
registered_user_count_per_brand BIGINT,
percentage_share_of_brand BIGINT,
quater INT,
year INT,
state VARCHAR(100),
PRIMARY KEY (my_index))"""

In [84]:
df3.to_sql('agg_user_table', con = engine, if_exists = 'append', chunksize = 1000)

6732

In [85]:
agg_user_summary_table = """CREATE TABLE agg_user_summary_table(
my_index INT NOT NULL AUTO_INCREMENT,
state VARCHAR(100),
year INT,
quater INT,
registered_users BIGINT,
app_opens BIGINT,
PRIMARY KEY (my_index))"""

In [86]:
df4.to_sql('agg_user_summary_table', con = engine, if_exists = 'append', chunksize = 1000)

720

In [87]:
lat_long_state = """CREATE TABLE lat_long_state(
my_index INT NOT NULL AUTO_INCREMENT,
code VARCHAR(50),
latitude BIGINT,
longitude BIDINT,
state VARCHAR(150),
PRIMARY KEY (my_index))"""

In [88]:
df5.to_sql('lat_long_state', con = engine, if_exists = 'append', chunksize = 1000)

36

In [89]:
lat_long_district = """CREATE TABLE lat_long_district(
my_index INT NOT NULL AUTO_INCREMENT,
state VARCHAR(100),
district_name VARCHAR(200),
latitude BIGINT,
longitude BIDINT,
PRIMARY KEY (my_index))"""

In [90]:
df6.to_sql('lat_long_district', con = engine, if_exists = 'append', chunksize = 1000)

732

In [91]:
map_trans_table = """CREATE TABLE map_trans_table(
my_index INT NOT NULL AUTO_INCREMENT,
district_name VARCHAR(200),
total_transaction_count BIGINT,
total_amount BIGINT,
quater INT,
year INT,
state VARCHAR(100),
PRIMARY KEY (my_index))"""

In [92]:
df7.to_sql('map_trans_table', con = engine, if_exists = 'append', chunksize = 1000)

14636

In [93]:
map_user_table = """CREATE TABLE map_user_table(
my_index INT NOT NULL AUTO_INCREMENT,
place_name VARCHAR(200),
registered_user_count BIGINT,
app_openings BIGINT,
quater INT,
year INT,
state VARCHAR(100),
PRIMARY KEY (my_index))"""

In [94]:
df8.to_sql('map_user_table', con = engine, if_exists = 'append', chunksize = 1000)

14640